### Aula 01 - O que é o pandas e do que ele é capaz

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_data = pd.read_csv("supermarket_sales.csv")
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

###    01 - Qual o faturamento total por filial?

In [3]:
df_data.groupby("City")["Total"].sum()

City
Mandalay     106197.6720
Naypyitaw    110568.7065
Yangon       106200.3705
Name: Total, dtype: float64

In [4]:
df_data. groupby("City")[["Total", "gross income"]].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

###  02 - Qual a percentual de participação na receira de casa tipo de produto?

In [5]:
(df_data.groupby("Product line")["Total"].sum() / df_data.groupby("Product line")["Total"].sum().sum()).sort_values() * 100
# .sort_values() --> È pra ordenar os valores da tabela do menor para o maior

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

###  03 - Como está distribuido o tipo de produto consumido por genero?

In [6]:
df_data.groupby(["Product line", "Gender"])[["Total"]].sum().pivot_table(index="Product line", columns="Gender")
# .pivot_table() --> organiza os dados na tabela de acordo com indice descrito

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

###  04 - Qual foi o faturamento por mês?

In [7]:
df_data["Date"] = pd.to_datetime(df_data["Date"])
df_data["Month"] = df_data["Date"].apply(lambda x: x.month)
df_data["Year"] = df_data["Date"].apply(lambda x: x.year)

In [8]:
df_data.groupby(["Month"])[["Total"]].sum()

            Total
Month
1      116291.868
2       97219.374
3      109455.507

###  05 - Qual foi a média de avaliação por cada filial em janeiro de 2019?

In [9]:
df_data[(df_data["Year"] == 2019) & (df_data["Month"] == 1)]["Rating"].mean()

7.017613636363635

### 06 - Como se distibui o gasto por tipo de consumidor em cada filial?

In [10]:
df_data.groupby(["Customer type", "City"])["Total"].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [11]:
df_data.groupby(["Customer type", "City"])[["Total"]].sum().pivot_table(index="Customer type", columns="City")

                   Total
City            Mandalay   Naypyitaw      Yangon
Customer type
Member         53704.686  56881.2825  53637.4755
Normal         52492.986  53687.4240  52562.8950

### Aula 04 - Series

In [12]:
import pandas as pd
import numpy as np

In [13]:
labels = ["a", "b", "c"]
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {"a":10, "b":20, "c":30}

In [14]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [15]:
pd.Series(data=labels, index=minha_lista) # Coloquei o meu index da minha preferência

10    a
20    b
30    c
dtype: object

In [16]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [17]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
ser1 = pd.Series([1, 2, 3, 4], index = ["EUA", "Alemanha", "USSR", "Japão"])

In [20]:
ser1

EUA         1
Alemanha    2
USSR        3
Japão       4
dtype: int64

In [21]:
ser2 = pd.Series([1, 2, 3, 4], index = ["EUA", "Alemanha", "Italia", "Japão"])

In [22]:
ser2

EUA         1
Alemanha    2
Italia      3
Japão       4
dtype: int64

In [23]:
ser1[["Alemanha", "EUA"]]

Alemanha    2
EUA         1
dtype: int64

In [24]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
USSR        NaN
dtype: float64

## * Aula 05 - DataFrame e Manipulação de colunas

In [25]:
from numpy.random import randn

In [26]:
df = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [27]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [28]:
df["W"]

A   -1.256719
B    0.760578
C    0.380681
D    1.196078
E   -0.585465
Name: W, dtype: float64

In [29]:
df[["W"]]

          W
A -1.256719
B  0.760578
C  0.380681
D  1.196078
E -0.585465

In [30]:
df["NEW"] = df["W"] + df["Y"]

In [31]:
df

          W         X         Y         Z       NEW
A -1.256719  2.151779  0.733274 -1.156860 -0.523445
B  0.760578  0.530736 -1.780258 -0.952909 -1.019680
C  0.380681 -0.269580 -1.514875  0.827034 -1.134194
D  1.196078 -0.213067 -0.593250 -0.911217  0.602828
E -0.585465 -0.211916  0.689383 -1.194314  0.103917

In [32]:
df.drop("NEW", axis=1)

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [33]:
df

          W         X         Y         Z       NEW
A -1.256719  2.151779  0.733274 -1.156860 -0.523445
B  0.760578  0.530736 -1.780258 -0.952909 -1.019680
C  0.380681 -0.269580 -1.514875  0.827034 -1.134194
D  1.196078 -0.213067 -0.593250 -0.911217  0.602828
E -0.585465 -0.211916  0.689383 -1.194314  0.103917

In [34]:
df.drop("NEW", axis=1, inplace=True)

In [35]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [36]:
df.loc[["A", "B"]]

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909

In [37]:
df.iloc[1, 2]

-1.7802581103557176

## * Aula 06 - iloc e Filtros

In [38]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [39]:
df.loc[["A", "C"], ["W"]]

          W
A -1.256719
C  0.380681

In [40]:
df.iloc[1:4, 1:3]

          X         Y
B  0.530736 -1.780258
C -0.269580 -1.514875
D -0.213067 -0.593250

In [41]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [42]:
df + df

          W         X         Y         Z
A -2.513438  4.303559  1.466548 -2.313719
B  1.521155  1.061472 -3.560516 -1.905817
C  0.761361 -0.539160 -3.029750  1.654068
D  2.392155 -0.426134 -1.186499 -1.822434
E -1.170930 -0.423833  1.378765 -2.388628

In [43]:
df[df > 0]

          W         X         Y         Z
A       NaN  2.151779  0.733274       NaN
B  0.760578  0.530736       NaN       NaN
C  0.380681       NaN       NaN  0.827034
D  1.196078       NaN       NaN       NaN
E       NaN       NaN  0.689383       NaN

In [44]:
df["Y"] > 0

A     True
B    False
C    False
D    False
E     True
Name: Y, dtype: bool

In [45]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [46]:
df[df["Y"] > 0]

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
E -0.585465 -0.211916  0.689383 -1.194314

In [47]:
(df["Y"] > 0) & (df["W"] > 0)

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [48]:
df[(df["Y"] > 0) & (df["W"] > 0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## * Aula 07 - Operações com Índices

In [49]:
df

          W         X         Y         Z
A -1.256719  2.151779  0.733274 -1.156860
B  0.760578  0.530736 -1.780258 -0.952909
C  0.380681 -0.269580 -1.514875  0.827034
D  1.196078 -0.213067 -0.593250 -0.911217
E -0.585465 -0.211916  0.689383 -1.194314

In [50]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [51]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [52]:
df.reset_index(inplace=True)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
df.set_index("index", inplace=True)

In [54]:
df

              W         X         Y         Z
index
A     -1.256719  2.151779  0.733274 -1.156860
B      0.760578  0.530736 -1.780258 -0.952909
C      0.380681 -0.269580 -1.514875  0.827034
D      1.196078 -0.213067 -0.593250 -0.911217
E     -0.585465 -0.211916  0.689383 -1.194314

In [55]:
novoind = "CA NY WY OR CO".split()

In [56]:
df["novo_index"] = novoind

In [57]:
df

              W         X         Y         Z novo_index
index
A     -1.256719  2.151779  0.733274 -1.156860         CA
B      0.760578  0.530736 -1.780258 -0.952909         NY
C      0.380681 -0.269580 -1.514875  0.827034         WY
D      1.196078 -0.213067 -0.593250 -0.911217         OR
E     -0.585465 -0.211916  0.689383 -1.194314         CO

In [58]:
df.set_index("novo_index")

                   W         X         Y         Z
novo_index
CA         -1.256719  2.151779  0.733274 -1.156860
NY          0.760578  0.530736 -1.780258 -0.952909
WY          0.380681 -0.269580 -1.514875  0.827034
OR          1.196078 -0.213067 -0.593250 -0.911217
CO         -0.585465 -0.211916  0.689383 -1.194314

In [59]:
df.reset_index().set_index("novo_index")

           index         W         X         Y         Z
novo_index
CA             A -1.256719  2.151779  0.733274 -1.156860
NY             B  0.760578  0.530736 -1.780258 -0.952909
WY             C  0.380681 -0.269580 -1.514875  0.827034
OR             D  1.196078 -0.213067 -0.593250 -0.911217
CO             E -0.585465 -0.211916  0.689383 -1.194314

## * Aula 08 - Índices multiníveis

In [60]:
# Níveis de Índice
outside = [ 'G1', 'G1', 'G1', 'G2', 'G2', 'G2',]
inside = [1,2,3, 1,2,3]
hier_index= list(zip(outside, inside))

In [61]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [62]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [63]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [64]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=["A", "B"])
df

             A         B
G1 1  0.564477 -0.172404
   2  0.304483  1.372898
   3  0.519318  0.956020
G2 1  1.025178 -0.147867
   2  1.213684 -1.602219
   3 -0.468412 -2.273743

In [65]:
df.loc["G1"]

          A         B
1  0.564477 -0.172404
2  0.304483  1.372898
3  0.519318  0.956020

In [66]:
df.loc["G1"].loc[1]

A    0.564477
B   -0.172404
Name: 1, dtype: float64

In [67]:
df.index.names

FrozenList([None, None])

In [68]:
df.index.names = ["Grupo", "Número"]

In [69]:
df

                     A         B
Grupo Número
G1    1       0.564477 -0.172404
      2       0.304483  1.372898
      3       0.519318  0.956020
G2    1       1.025178 -0.147867
      2       1.213684 -1.602219
      3      -0.468412 -2.273743

In [70]:
df.xs(1, level="Número")

              A         B
Grupo
G1     0.564477 -0.172404
G2     1.025178 -0.147867

## * Aula 09 - Tratamento de dados ausentes

Manipulção de dados ausentes

In [71]:
import pandas as pd
import numpy as np

In [72]:
df = pd.DataFrame({"A": [1,2,np.nan], 
                   "B": [5,np.nan,np.nan],
                   "C": [1,2,3]})

In [73]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [75]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [76]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [77]:
df.fillna("Conteúdo")

          A         B  C
0       1.0       5.0  1
1       2.0  Conteúdo  2
2  Conteúdo  Conteúdo  3

In [78]:
df["A"].mean()

1.5

In [79]:
df.fillna(value=df["A"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [80]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [81]:
df.ffill()
# df.pfill() ----Pega os elementos tipo 31 po 21

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [82]:
df.fillna(value=df["A"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [83]:
import scipy.stats as stats